KirinDenis/ViewOwl_ESP32/ViewOwl.ESP32_EPD.Client/sdkconfig.defaults
# Target is the ESP32-S3 (4.2" e-paper board: RES/DC/CS/BUSY on GPIO 45-48).
# If a stale sdkconfig exists, delete it or run: idf.py set-target esp32s3
# NOTE: the VS Code ESP-IDF extension's active target overrides this — set it to
# esp32s3 in the status bar too.
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
